[
  {
    "title": "Educational Platform",
    "image": "./images/education-home.png",
    "tag": "Education",
    "description": "An interactive platform offering a wide variety of courses, quizzes, and certifications.",
    "details": "Educational Platform includes personalised learning paths for students.",
    "link": "https://educational-platform-ten.vercel.app/"
  },
  {
    "title": "League Profiler",
    "image": "./images/league-home.png",
    "tag": "Gaming",
    "description": "A platform for analysing and tracking player statistics in competitive game league of legends.",
    "details": "League Profiler provides real-time data, performance analytics, and insights for personal and team improvements."
  },
  {
    "title": "Real-time Messaging",
    "image": "./images/real-time-messaging.png",
    "tag": "WebSockets",
    "description": "An application which utilises WebSockets built within the browser for persistent connection.",
    "details": "Creating a website to understand networking with web sockets and to create a chat application to message users in real-time. Not Complete however basic functionalities are implemented.",
    "link": "https://real-time-messaging-gray.vercel.app/"
  },
  {
    "title": "Personal Dashboard",
    "image": "./images/dashboard-2.png",
    "tag": "App Development",
    "description": "(Work in Progress) Creating and Designing a personal dashboard using 'electron' which is browser based technology used to create desktop applications using web technologies.",
    "details": "By utilising front-end and back-end technologies which I am proficient in and Electron a package which allows to create desktop applications with web technologies, I am able to create a personal application which various features to suit my needs such as Daily Weather Reports, Motivational Quote Generation and much more. Used Open Weather API to obtain weather data, and Chart.js to create graphs with the weather data.",
    "html": "dashboard"
  },
  {
    "title": "Anime Tracker",
    "image": "./images/anime-tracker.png",
    "tag": "REST API",
    "description": "Anime & Manga Tracker website using GET requests through REST API.",
    "details": "Built an Anime & Manga tracker website which displays content based on search queries, this data is displayed with an associated ANIME API."
  },
  {
    "title": "Predication on Salary",
    "image": "./images/datasciencepython.png",
    "tag": "Machine Learning",
    "description": "Built a classification model to automate salary categorisation for new hires, reducing negotiation time.",
    "details": "Utilised Python, Pandas, and Scikit-learn for data processing, model development, and evaluation. Improved decision-making efficiency by enabling accurate, data-driven salary predictions."
  },
  {
    "title": "Fitness Tracker",
    "image": "./images/fitness-home.jpg",
    "tag": "Fitness",
    "description": "A comprehensive app to monitor fitness activities, track goals, and measure progress.",
    "details": "Fitness Tracker was built based on personal frustrations with analytics hidden behind paywalls, and to imrpove my coding skills, I retrieved data from my personal scale which has information on weight, muscle mass, etc. this data was used to create statistical graphs for this website idea and to imrpove personal health goals."
  },
  {
    "title": "Snake on Android",
    "image": "./images/snake_android.png",
    "tag": "Android",
    "description": "Create a replica of Snake with additional features built on Android Studio, this project uses Kotlin/Java.",
    "details": "",
    "pdf": "./pdf/CS2PJ16_Android.pdf"
  },
  {
    "title": "Drone Simulator",
    "image": "./images/dronesim.png",
    "tag": "Java",
    "description": "While improving proficiency in Java and Object Oritentied Programming, I created a drone simualtor which `Mario` inspired Map creation.",
    "details": "",
    "pdf": "./pdf/CS2PJ20_CW.pdf"
  },
  {
    "title": "VR Game - Unity",
    "image": "./images/vr.png",
    "tag": "Unity C#",
    "description": "Group Project to create a 3D unity game for VR, the chosen topic was Animals and revolved the game aspects based on the topic which includes various biomes and quizes with user interactions in each biome.",
    "details": "",
    "pdf": "./pdf/CS3VR16_29003671_IndividualReport.pdf"
  },
  {
    "title": "Blockchain",
    "image": null,
    "tag": "Blockchain",
    "description": "",
    "details": ""
  },
  {
    "title": "Noise Reduction",
    "image": null,
    "tag": "Image Analysis",
    "description": "",
    "details": ""
  },
  {
    "title": "Compression & Decompression",
    "image": null,
    "tag": "Image Analysis",
    "description": "",
    "details": ""
  },
  {
    "title": "KNIME",
    "image": null,
    "tag": "Data Science",
    "description": "",
    "details": ""
  },
  {
    "title": "Water Potability with AI",
    "image": null,
    "tag": "Artificial Inteligence",
    "description": "",
    "details": ""
  },
  {
    "title": "Sales Storyboard with Tableau",
    "image": null,
    "tag": "Tableau",
    "description": "",
    "details": ""
  }
]